<?php
namespace App\Smarty;

class SelectionModifiers{
	private static $role = [
		"admin" => "管理者",
		"entry" => "一般ユーザー",
	];
	private static $closeProcessing = [
		"0" => "都度請求",
		"1" => "締め請求",
	];
	private static $existence = [
		"0" => "無",
		"1" => "有",
	];
	private static $invoiceFormat = [
		"1" => "通常請求書",
		"2" => "ニッピ用請求書",
		"3" => "加茂繊維用請求書",
		"4" => "ダイドー用請求書",
	];
	private static $numberingSystem = [
		"1" => "年度",
		"2" => "月度",
		"3" => "手動",
	];
	private static $paymentType = [
		"1" => "現金",
		"2" => "振込",
		"3" => "手数料",
		"4" => "手形",
	];
	private static $summaryType = [
		"1" => "売上伝票",
		"2" => "入金伝票",
		"3" => "請求書",
	];
	private static $taxProcessing = [
		"1" => "外税/伝票計",
		"2" => "外税/請求時",
		"3" => "内税/伝票計",
		"4" => "内税/請求時",
		"5" => "免税",
		"6" => "外税/手入力",
	];
	private static $taxRound = [
		"floor" => "切り捨て",
		"ceil"  => "切り上げ",
		"round" => "四捨五入",
	];
	private static $unitPriceType = [
		"1" => "売上単価1",
		"2" => "売上単価2",
		"3" => "売上単価3",
		"4" => "売上単価4",
		"5" => "売上単価5",
	];
	private static $prefectures = [
		"北海道" => "北海道",
		"青森県" => "青森県",
		"岩手県" => "岩手県",
		"宮城県" => "宮城県",
		"秋田県" => "秋田県",
		"山形県" => "山形県",
		"福島県" => "福島県",
		"茨城県" => "茨城県",
		"栃木県" => "栃木県",
		"群馬県" => "群馬県",
		"埼玉県" => "埼玉県",
		"千葉県" => "千葉県",
		"東京都" => "東京都",
		"神奈川県" => "神奈川県",
		"新潟県" => "新潟県",
		"富山県" => "富山県",
		"石川県" => "石川県",
		"福井県" => "福井県",
		"山梨県" => "山梨県",
		"長野県" => "長野県",
		"岐阜県" => "岐阜県",
		"静岡県" => "静岡県",
		"愛知県" => "愛知県",
		"三重県" => "三重県",
		"滋賀県" => "滋賀県",
		"京都府" => "京都府",
		"大阪府" => "大阪府",
		"兵庫県" => "兵庫県",
		"奈良県" => "奈良県",
		"和歌山県" => "和歌山県",
		"鳥取県" => "鳥取県",
		"島根県" => "島根県",
		"岡山県" => "岡山県",
		"広島県" => "広島県",
		"山口県" => "山口県",
		"徳島県" => "徳島県",
		"香川県" => "香川県",
		"愛媛県" => "愛媛県",
		"高知県" => "高知県",
		"福岡県" => "福岡県",
		"佐賀県" => "佐賀県",
		"長崎県" => "長崎県",
		"熊本県" => "熊本県",
		"大分県" => "大分県",
		"宮崎県" => "宮崎県",
		"鹿児島県" => "鹿児島県",
		"沖縄県" => "沖縄県",
	];
	private static $closeDate = [
		"1" => "1",
		"2" => "2",
		"3" => "3",
		"4" => "4",
		"5" => "5",
		"6" => "6",
		"7" => "7",
		"8" => "8",
		"9" => "9",
		"10" => "10",
		"11" => "11",
		"12" => "12",
		"13" => "13",
		"14" => "14",
		"15" => "15",
		"16" => "16",
		"17" => "17",
		"18" => "18",
		"19" => "19",
		"20" => "20",
		"21" => "21",
		"22" => "22",
		"23" => "23",
		"24" => "24",
		"25" => "25",
		"26" => "26",
		"27" => "27",
	];
	private static $monthList = [
		"1" => "1",
		"2" => "2",
		"3" => "3",
		"4" => "4",
		"5" => "5",
		"6" => "6",
		"7" => "7",
		"8" => "8",
		"9" => "9",
		"10" => "10",
		"11" => "11",
		"12" => "12",
	];
	public static function __callStatic($target, $args){
		$assoc = self::$$target;
		$code = $args[0];
		
		if(is_array($code)){
			$res = [];
			foreach($code as $k => $v){
				if(array_key_exists($k, $assoc)){
					continue;
				}
				$res[$k] = $v;
			}
			foreach($assoc as $k => $v){
				if(array_key_exists($k, $code)){
					if(!is_null($code[$k])){
						$res[$k] = $code[$k];
					}
				}else{
					$res[$k] = $v;
				}
			}
			return $res;
		}else{
			if(array_key_exists($code, $assoc)){
				return $assoc[$code];
			}else{
				return "";
			}
		}
	}
}